export default [
    {
        "id": 1,
        "关系": "本人",
        "姓名": "丁万强",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 11,
        "mid": 12,
        "pids": [
            "2",
            "1111111111"
        ]
    },
    {
        "id": 2,
        "关系": "妻子",
        "姓名": "崔丽",
        "gender": "female",
        "详情": "(其他、不在册、非安置)",
        "fid": null,
        "mid": null,
        "pids": [
            "1"
        ]
    },
    {
        "id": 1111111111,
        "关系": "前妻",
        "姓名": "崔丽",
        "gender": "female",
        "详情": "(其他、不在册、非安置)",
        "fid": null,
        "mid": null,
        "pids": [
            "1"
        ]
    },

    // 儿子
    {
        "id": 3,
        "关系": "大儿子",
        "姓名": "顾洋",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 1,
        "mid": 2,
        "pids": null
    },
    {
        "id": 4,
        "关系": "二儿子",
        "姓名": "林刚",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 1,
        "mid": 2,
        "pids": null
    },
    {
        "id": 5,
        "关系": "三儿子",
        "姓名": "郝超",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 1,
        "mid": 2,
        "pids": null
    },
    // 前妻的儿子
    {
        "id": 6,
        "关系": "前妻的儿子",
        "姓名": "郝超",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 1,
        "mid": 1111111111,
        "pids": null
    },

    // 爸爸
    {
        "id": 11,
        "关系": "父亲",
        "姓名": "曹敏",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": null,
        "mid": null,
        "pids":  [
            "12"
        ]
    },
    {
        "id": 12,
        "关系": "母亲",
        "姓名": "程娜",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            "11"
        ]
    },
]