export default [
    {
        "id": 1,
        "关系": "本人",
        "姓名": "丁万强",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 11,
        "mid": 12,
        "pids": [
            "2",
            "1111111111"
        ]
    },
    {
        "id": 2,
        "关系": "妻子",
        "姓名": "崔丽",
        "gender": "female",
        "详情": "(其他、不在册、非安置)",
        "fid":  19,
        "mid": 20,
        "pids": [
            "1"
        ]
    },
    {
        "id": 1111111111,
        "关系": "前妻",
        "姓名": "崔丽",
        "gender": "female",
        "详情": "(其他、不在册、非安置)",
        "fid": null,
        "mid": null,
        "pids": [
            "1"
        ]
    },

    // 儿子
    {
        "id": 3,
        "关系": "大儿子",
        "姓名": "顾洋",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 1,
        "mid": 2,
        "pids": [
            "31"
        ]
    },
    {
        "id": 31,
        "关系": "大儿子的妻子",
        "姓名": "汪秀英",
        "gender": "female",
        "详情": "(其他、不在册、非安置)",
        "fid": null,
        "mid": null,
        "pids": [
            "3"
        ]
    },
    {
        "id": 311,
        "关系": "大儿子的儿子",
        "姓名": "吕军",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 3,
        "mid": 31,
        "pids": null
    },
    {
        "id": 4,
        "关系": "二儿子",
        "姓名": "林刚",
        "gender": "male",
        "详情": "(其他、不在册、非安置)",
        "fid": 1,
        "mid": 2,
        "pids": null
    },
    {
        "id": 5,
        "关系": "三儿子",
        "姓名": "郝超",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 1,
        "mid": 2,
        "pids": null
    },
    // 前妻的儿子
    {
        "id": 6,
        "关系": "前妻的儿子",
        "姓名": "郝超",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 1,
        "mid": 1111111111,
        "pids": null
    },

    // 爸爸
    {
        "id": 11,
        "关系": "父亲",
        "姓名": "曹敏",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 15,
        "mid": 16,
        "pids":  [
            "12"
        ]
    },
    // 母亲
    {
        "id": 12,
        "关系": "母亲",
        "姓名": "程娜",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            "11"
        ]
    },

    // 爸爸的同辈
    {
        "id": 13,
        "关系": "大伯",
        "姓名": "邵洋",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 15,
        "mid": 16,
        "pids": [
            "131",
        ]
    },
    {
        "id": 131,
        "关系": "大伯的妻子",
        "姓名": "陆秀英",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            "13"
        ]
    },
    {
        "id": 14,
        "关系": " 二伯",
        "姓名": "白平",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 15,
        "mid": 16,
        "pids": null
    },

    // 妈妈的同辈
    // {
    //     "id":  17,
    //     "关系": " 舅舅",
    //     "姓名": "马静",
    //     "详情": "(其他、不在册、非安置)",
    //     "gender": "male",
    //     "fid": 19,
    //     "mid": 20,
    //     "pids": null
    // },
    // {
    //     "id":   18,
    //     "关系": " 二舅",
    //     "姓名": "石平",
    //     "详情": "(其他、不在册、非安置)",
    //     "gender": "male",
    //     "fid": 19,
    //     "mid": 20,
    //     "pids": null
    // },

    // 爷爷奶奶
    {
        "id": 15,
        "关系": " 爷爷",
        "姓名": "史秀兰",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": null,
        "mid": null,
        "pids": [
            "16"
        ]
    },
    {
        "id": 16,
        "关系": "奶奶",
        "姓名": "毛芳",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            "15"
        ]
    },
    // 岳父岳母
    {
        "id": 19,
        "关系": "岳父",
        "姓名": "田军",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": null,
        "mid": null,
        "pids": [
            "20"
        ]
    },
    {
        "id": 20,
        "关系": "岳母",
        "姓名": "雷敏",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            "19"
        ]
    },
    // 我的同辈
    {
        "id": 21,
        "关系": "哥哥",
        "姓名": "侯秀兰",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 11,
        "mid": 12,
        "pids": [
            '211'
        ]
    },
    {
        "id": 211,
        "关系": "哥哥的妻子",
        "姓名": "侯秀兰的妻子",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": null,
        "mid": null,
        "pids": [
            '21'
        ]
    },
    {
        "id": 22,
        "关系": "姐姐",
        "姓名": "吕娟",
        "详情": "(其他、不在册、非安置)",
        "gender": "female",
        "fid": 11,
        "mid": 12,
        "pids": null
    },
    {
        "id": 23,
        "关系": "哥哥",
        "姓名": "常超",
        "详情": "(其他、不在册、非安置)",
        "gender": "male",
        "fid": 11,
        "mid": 12,
        "pids": null
    },
]